Ran Plan for project: `seagl` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.icmp4-ingress will be destroyed
  # (because openstack_networking_secgroup_rule_v2.icmp4-ingress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "icmp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "585443d0-f2b6-4bc4-bc64-22de84183d11" -> null
      - port_range_max    = 0 -> null
      - port_range_min    = 0 -> null
      - protocol          = "icmp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.ipv4-egress will be destroyed
  # (because openstack_networking_secgroup_rule_v2.ipv4-egress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "ipv4-egress" {
      - direction         = "egress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "64ee8d25-c7bf-4d6a-87f4-ababe16bc1c9" -> null
      - port_range_max    = 0 -> null
      - port_range_min    = 0 -> null
      - region            = "RegionOne" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.ipv6-egress will be destroyed
  # (because openstack_networking_secgroup_rule_v2.ipv6-egress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "ipv6-egress" {
      - direction         = "egress" -> null
      - ethertype         = "IPv6" -> null
      - id                = "cdc24719-5871-43c6-b808-c0e4a396dfea" -> null
      - port_range_max    = 0 -> null
      - port_range_min    = 0 -> null
      - region            = "RegionOne" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["22"] will be destroyed
  # (because openstack_networking_secgroup_rule_v2.tcp4-ingress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "27d1d717-968e-426a-9e47-854fa1f73283" -> null
      - port_range_max    = 22 -> null
      - port_range_min    = 22 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["443"] will be destroyed
  # (because openstack_networking_secgroup_rule_v2.tcp4-ingress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "17ee158a-b323-4fa2-8ef1-7a92268131a1" -> null
      - port_range_max    = 443 -> null
      - port_range_min    = 443 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["80"] will be destroyed
  # (because openstack_networking_secgroup_rule_v2.tcp4-ingress is not in configuration)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "efaa1a6d-ae00-47c1-b365-061fe1cec1db" -> null
      - port_range_max    = 80 -> null
      - port_range_min    = 80 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_v2.main-sg will be destroyed
  # (because openstack_networking_secgroup_v2.main-sg is not in configuration)
- resource "openstack_networking_secgroup_v2" "main-sg" {
      - all_tags             = [] -> null
      - delete_default_rules = true -> null
      - id                   = "8c3bd340-4e15-41fc-b959-6e75018d9dab" -> null
      - name                 = "dokku" -> null
      - region               = "RegionOne" -> null
      - tags                 = [] -> null
      - tenant_id            = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.mailu-vm.aws_route53_record.dns-a will be updated in-place
~ resource "aws_route53_record" "dns-a" {
        id                               = "Z0173878287JIU5M4KB8R_mailu.host.seagl.org_A"
        name                             = "mailu.host.seagl.org"
      ~ records                          = [
          - "140.211.167.187",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.production_env.module.mailu-vm.openstack_compute_instance_v2.instance must be replaced
-/+ resource "openstack_compute_instance_v2" "instance" {
      ~ access_ip_v4        = "140.211.167.187" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-03-13 03:19:56 +0000 UTC" -> (known after apply)
      ~ flavor_id           = "952b0e9a-6ded-46c4-9704-ce6745e9f2c1" -> (known after apply)
      ~ id                  = "c388c80b-fa29-40fe-ae0b-e93803e87b22" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "mailu"
      ~ region              = "RegionOne" -> (known after apply)
      - tags                = [] -> null
      ~ updated             = "2024-03-13 03:20:06 +0000 UTC" -> (known after apply)
      + user_data           = "ce58ac6040dd5ef465c704b49ba6d6600287333a"
        # (6 unchanged attributes hidden)

      ~ block_device {
          - boot_index            = 0 -> null
          ~ uuid                  = "5e7b09b5-03f1-4f01-bc1b-41db2e1b09d1" -> "b36b5513-5f8e-4ee9-9b1e-3e8fb7a6ffff" # forces replacement
            # (5 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "140.211.167.187" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:5d:31:25" -> (known after apply)
            name           = "general_servers2"
          + port           = (known after apply)
          ~ uuid           = "bcfb335b-cf70-4acf-8cb7-fcf15f890a0f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 8 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 30, in provider "openstack":
│   30: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seagl`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seagl`
</details>
Plan: 1 to add, 1 to change, 8 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`